In [5]:
import numpy as np
import pandas as pd

In [8]:
col_name1 = ['col']
l1 = [1,2,3]
array1 = np.array(l1)
print('array1 shape : ', array1.shape)

array1 shape :  (3,)

In [7]:
# list 활용하여 df 생성
df_l1 = pd.DataFrame(l1, columns=col_name1)
print('1차원 리스트로 생성한 df:\n', df_l1)
df_l1

1차원 리스트로 생성한 df:
    col
0    1
1    2
2    3

   col
0    1
1    2
2    3

In [9]:
# numpy array를 활용하여 df 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 array로 생성한 df:\n', df_array1)

1차원 array로 생성한 df:
    col
0    1
1    2
2    3

In [13]:
# dict를 활용하여 df 생성
df_dict1 = pd.DataFrame({'col':[1,2,3]})
print('1차원 dictionary로 생성한 df:\n', df_dict1)

1차원 dictionary로 생성한 df:
    col
0    1
1    2
2    3

In [22]:
## 2차원 df로 각 자료형들의 상호변환
col_name2 = ['col1', 'col2', 'col3']

l2 = [[1,2,3],
      [11,22,33]]

In [19]:
df_l2 = pd.DataFrame(l2, columns=col_name2)
print('2차원 list로 만든 df:\n', df_l2)

2차원 list로 만든 df:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [23]:
array2 = np.array(l2)
print('array2 shape:\n', array2.shape)
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 array로 만든 df:\n', df_array2)

array2 shape:
 (2, 3)
2차원 array로 만든 df:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [24]:
dict2 = {'col1':[1,11],
         'col2':[2,22],
         'col3':[3,33]}
df_dict2 = pd.DataFrame(dict2)
print('2차원 dictionary로 만든 df:\n', df_dict2)

2차원 dictionary로 만든 df:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [25]:
# df를 ndarray로 변환
array3 = df_dict2.values
print('df_dict2 values type :', type(array3), '\ndf_dict2.value shape:', array3.shape)

df_dict2 values type : <class 'numpy.ndarray'>
df_dict2.value shape: (2, 3)

In [27]:
# df를 ndarray로 변환 후 list로 변환
l3 = df_dict2.values.tolist()
print('df_dict2.values.tolist type:', type(l3))

df_dict2.values.tolist type: <class 'list'>

In [29]:
# df를 dict로 변환
dict3 = df_dict2.to_dict('list')
print('df_dict.to_dict type:', type(dict3))
print(dict3)

df_dict.to_dict type: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

data handling - titanic

www.kaggle.com/c/titanic/data

In [30]:
import pandas as pd
titan_df = pd.read_csv('train.csv')
titan_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
titan_df.shape

(891, 12)

In [37]:
titan_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [38]:
titan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [40]:
titan_df.isna().sum()
titan_df['Age'] = titan_df['Age'].fillna(np.mean(titan_df['Age'])) # titan_df['Age'].mean

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [41]:
titan_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [51]:
# 나머지 결측값들을 'NAN' - 'N'으로 바꿔두세요
titan_df['Cabin'].value_counts()
titan_df['Cabin'] = titan_df['Cabin'].fillna('N')
titan_df['Cabin'].str[0:1].value_counts()

titan_df['Cabin'] = titan_df['Embarked']

N    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [ ]:
# 새로운 컬럼 생성
titan_df['sey']='sey'
titan_df